# **그룹화**

In [ ]:
import pandas as pd

df1 = pd.DataFrame({'ID' : [1, 2, 3, 4, 5], '가입일' : ['2021-01-02', '2021-01-04', '2021-01-10', '2021-02-10', '2021-02-24'], '성별' : ['F', 'M', 'F', 'M', 'M']})
df2 = pd.DataFrame({'구매순서' : [1, 2, 3, 4, 5], 'ID' : [1, 1, 2, 4, 1], '구매월' : [1, 1, 2, 2, 3], '금액' : [1000, 1500, 2000, 3000, 4000]})

\- 문제 : df1 은 회원의 정보를 저장한 데이터 프레임이며, df2 는 각 회원의 구매 내역을 저장한 데이터 프레임이다. 각 회원의 정보와 구매 내역을 취합하여 하나의 데이터 프레임으로 만드시오.

In [ ]:
pd.merge(df1, df2, how = 'left', on = 'ID')

   ID         가입일 성별  구매순서  구매월      금액
0   1  2021-01-02  F   1.0  1.0  1000.0
1   1  2021-01-02  F   2.0  1.0  1500.0
2   1  2021-01-02  F   5.0  3.0  4000.0
3   2  2021-01-04  M   3.0  2.0  2000.0
4   3  2021-01-10  F   NaN  NaN     NaN
5   4  2021-02-10  M   4.0  2.0  3000.0
6   5  2021-02-24  M   NaN  NaN     NaN

\- 문제 : df1 은 회원의 정보를 저장한 데이터 프레임이며, df2 는 각 회원의 구매 내역을 저장한 데이터 프레임이다. 각 회원의 누적 금액을 회원 ID 별로 구하시오.

In [ ]:
df2

   구매순서  ID  구매월    금액
0     1   1    1  1000
1     2   1    1  1500
2     3   2    2  2000
3     4   4    2  3000
4     5   1    3  4000

In [ ]:
df2.groupby(by = ['ID'])['금액'].sum()

ID
1    6500
2    2000
4    3000
Name: 금액, dtype: int64

In [ ]:
type(df2.groupby(by = ['ID'])['금액'].sum())

pandas.core.series.Series

In [ ]:
s2 = df2.groupby(by = ['ID'])['금액'].sum()

In [ ]:
pd.merge(df1, s2, how = 'left', on = 'ID')

   ID         가입일 성별      금액
0   1  2021-01-02  F  6500.0
1   2  2021-01-04  M  2000.0
2   3  2021-01-10  F     NaN
3   4  2021-02-10  M  3000.0
4   5  2021-02-24  M     NaN

\- 문제 : df1 은 회원의 정보를 저장한 데이터 프레임이며, df2 는 각 회원의 구매 내역을 저장한 데이터 프레임이다. 각 회원의 월별 누적 금액을 회원 ID 별로 구하시오.

In [ ]:
df2

   구매순서  ID  구매월    금액
0     1   1    1  1000
1     2   1    1  1500
2     3   2    2  2000
3     4   4    2  3000
4     5   1    3  4000

In [ ]:
df2.groupby(by = ['ID', '구매월'])['금액'].sum()

ID  구매월
1   1      2500
    3      4000
2   2      2000
4   2      3000
Name: 금액, dtype: int64

In [ ]:
type(df2.groupby(by = ['ID', '구매월'])['금액'].sum())

pandas.core.series.Series

In [ ]:
s2 = df2.groupby(by = ['ID', '구매월'])['금액'].sum()

In [ ]:
s2.index

MultiIndex([(1, 1),
            (1, 3),
            (2, 2),
            (4, 2)],
           names=['ID', '구매월'])

In [ ]:
pd.merge(df1, s2, how = 'left', on = 'ID')

   ID         가입일 성별      금액
0   1  2021-01-02  F  2500.0
1   1  2021-01-02  F  4000.0
2   2  2021-01-04  M  2000.0
3   3  2021-01-10  F     NaN
4   4  2021-02-10  M  3000.0
5   5  2021-02-24  M     NaN

In [ ]:
df3 = pd.DataFrame(s2)

In [ ]:
df3

          금액
ID 구매월
1  1    2500
   3    4000
2  2    2000
4  2    3000

In [ ]:
df3.index

MultiIndex([(1, 1),
            (1, 3),
            (2, 2),
            (4, 2)],
           names=['ID', '구매월'])

In [ ]:
pd.merge(df1, df3, how = 'left', on = 'ID')

   ID         가입일 성별      금액
0   1  2021-01-02  F  2500.0
1   1  2021-01-02  F  4000.0
2   2  2021-01-04  M  2000.0
3   3  2021-01-10  F     NaN
4   4  2021-02-10  M  3000.0
5   5  2021-02-24  M     NaN

\- 그룹을 index 로 사용하고 싶지 않은 경우에는 as_index = False 로 설정

In [ ]:
# df2를 가지고 그룹화 할 건데, ID 와 구매월을 기준으로 할거야
# ID 와 구매월을 인덱스로 하지는 말고 금액의 합을 알고 싶다.

df2.groupby(by = ['ID', '구매월'], as_index = False)['금액'].sum()

   ID  구매월    금액
0   1    1  2500
1   1    3  4000
2   2    2  2000
3   4    2  3000

In [ ]:
type(df2.groupby(by = ['ID', '구매월'], as_index = False)['금액'].sum())

pandas.core.frame.DataFrame

In [ ]:
df3 = df2.groupby(by = ['ID', '구매월'], as_index = False)['금액'].sum()

In [ ]:
pd.merge(df1, df3, how = 'left', on = 'ID')

   ID         가입일 성별  구매월      금액
0   1  2021-01-02  F  1.0  2500.0
1   1  2021-01-02  F  3.0  4000.0
2   2  2021-01-04  M  2.0  2000.0
3   3  2021-01-10  F  NaN     NaN
4   4  2021-02-10  M  2.0  3000.0
5   5  2021-02-24  M  NaN     NaN

\- 문제 : df 는 각 회원의 구매 내역을 저장한 데이터 프레임이다. 각 회원의 누적 금액과 누적 구매 횟수를 회원 ID 별로 구하시오.

In [ ]:
df = pd.DataFrame({'구매순서' : [1, 2, 3, 4, 5], 'ID' : [1, 1, 2, 4, 1], '구매월' : [1, 1, 2, 2, 3], '금액' : [1000, 1500, 2000, 3000, 4000], '수수료' : [100, 150, 200, 300, 400]})

In [ ]:
df

   구매순서  ID  구매월    금액  수수료
0     1   1    1  1000  100
1     2   1    1  1500  150
2     3   2    2  2000  200
3     4   4    2  3000  300
4     5   1    3  4000  400

In [ ]:
# ID를 기준으로 df를 그룹화 할거야. 그 금액의 합과 각 ID가 몇 번 나왔는지
df.groupby(by = ['ID'])['금액'].agg([sum, len])

     sum  len
ID
1   6500    3
2   2000    1
4   3000    1

In [ ]:
df.groupby(by = ['ID'], as_index = False)['금액'].agg([sum, len])

     sum  len
ID
1   6500    3
2   2000    1
4   3000    1

In [ ]:
df2 = df.groupby(by = ['ID'])['금액'].agg([sum, len])

In [ ]:
df2.reset_index(inplace = True)     # ID가 위에서는 인덱스였음 -> ID를 칼럼명으로 하고 인덱스 따로 있을 수 있게

In [ ]:
df2

   ID   sum  len
0   1  6500    3
1   2  2000    1
2   4  3000    1

\- 문제 : df 는 각 회원의 구매 내역을 저장한 데이터 프레임이다. 각 회원의 최대 사용 금액 / 최소 사용 금액과 최저 수수료의 값을 구하시오.

In [ ]:
df

   구매순서  ID  구매월    금액  수수료
0     1   1    1  1000  100
1     2   1    1  1500  150
2     3   2    2  2000  200
3     4   4    2  3000  300
4     5   1    3  4000  400

In [ ]:
df.groupby(by = ['ID']).agg({'금액' : [max, min], '수수료' : min})

      금액        수수료
     max   min  min
ID
1   4000  1000  100
2   2000  2000  200
4   3000  3000  300

In [ ]:
df2 = df.groupby(by = ['ID']).agg({'금액' : [max, min], '수수료' : min})

In [ ]:
df2.reset_index()

  ID    금액        수수료
       max   min  min
0  1  4000  1000  100
1  2  2000  2000  200
2  4  3000  3000  300

In [ ]:
df2.columns

MultiIndex([( '금액', 'max'),
            ( '금액', 'min'),
            ('수수료', 'min')],
           )

In [ ]:
df2.columns.values

array([('금액', 'max'), ('금액', 'min'), ('수수료', 'min')], dtype=object)

In [ ]:
# df2.columns.values의 값을 한 뭉텅이 씩 뽑아서 join 함수로 예를들어 '금액_max'로  바꾸고 칼럼명에 대입한다.

df2.columns = ['_'.join(col) for col in df2.columns.values]

In [ ]:
df2

    금액_max  금액_min  수수료_min
ID
1     4000    1000      100
2     2000    2000      200
4     3000    3000      300

In [ ]:
 df2.reset_index()

   ID  금액_max  금액_min  수수료_min
0   1    4000    1000      100
1   2    2000    2000      200
2   4    3000    3000      300